# Watts Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Watts Property
UnitTypeId Class See Also
---
Watts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Watts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Watts As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Watts {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace